var doc = new jsPDF();
doc.addFont("test/reference/fonts/AlpidaUnicodeSystem.ttf", "Uyfont", "normal");

doc.setFont("Uyfont"); // set font
doc.setFontSize(20);

var uyghurText = "ئۇيغۇرلار شىنجاڭ ئۇيغۇر ئاپتونوم رايونىنىڭ ھەقىقىي ئىگىلىرى ۋە مىراسخورلىرى بولۇپ، بۇ رايوندا توپلىشىپ ياشايدىغان غوللۇق، يەرلىك مىللەت ۋە ئاپتونومىيە ھوقۇقى يۈرگۈزگۈچى مىللەت. ئۇيغۇرلار پارچە ھالەتتە، جۇڭگونىڭ بىر قاتار چوڭ شەھەرلىرىدە خىزمەت ۋە تىجارەت قىلىدۇ. ئۇيغۇرلار شىنجاڭ ئۇيغۇر ئاپتونوم رايونىدىن باشقا، يەنە جۇڭگو، قازاقىستان، قىرغىزىستان، ئۆزبېكىستان، تاجىكىستان، تۈركمەنىستان (ئاساسلىقى بايرام ئەلى رايونى)، پاكىستان، ئەرەبىستان، تۈركىيە، ئاۋسترالىيە، گېرمانىيە، نورۋىگىيە، گوللاندىيە، شىۋىتسىيە، فىنلاندىيە، بېلگىيە، روسيە، ئامېرىكا قاتارلىق دۆلەتلەردە كۆرۈنەرلىك نوپۇستا، مۇئەييەن جامائەت تۈركۈمى شەكلىدە ياشايدۇ. ";

doc.text(uyghurText, 200, 20, { align: "right", maxWidth: 230 });
